000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КассыККМ/КассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КассыККМ</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяФормаЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВМагазине</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьКодQR</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьЧековНаПринтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ПРРО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКассы</name>
    <type>
      <types>EnumRef.ТипыКассККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаККМ</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЛенты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыКассККМ/ТипыКассККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКассККМ</name>
  <enumValues>
    <name>ФискальныйРегистратор</name>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КассыККМ/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка ИЛИ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "СлужебныйРежимЗаписи", Ложь) = Истина Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "Организация");

		Если ЗначениеЗаполнено(Организация) И НЕ Организация = Владелец Тогда

			Владелец = Организация;
			Сообщить("Установлен новый владелец по магазину - «" + Владелец + "»");

		КонецЕсли;

		ПроверитьПодключаемоеОборудование(Отказ);

	КонецЕсли;
	
КонецПроцедуры

//	LNK 20.04.2017 10:40:25
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка ИЛИ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "СлужебныйРежимЗаписи", Ложь) = Истина Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		ДанныеЗаполнения.Свойство("Владелец", Владелец);
		ДанныеЗаполнения.Свойство("Магазин", Магазин);

		Если НЕ ЗначениеЗаполнено(Владелец) И ЗначениеЗаполнено(Магазин) Тогда

			Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "Организация");

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//	LNK 22.02.2022 10:34:45
Процедура ПроверитьПодключаемоеОборудование(Отказ)

	Если ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КассыККМ.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.Магазин = &Магазин
		|	И КассыККМ.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ФискальныйРегистратор)
		|	И КассыККМ.Владелец = &Владелец
		|	И КассыККМ.РабочееМесто = &РабочееМесто
		|	И НЕ КассыККМ.Ссылка = &Ссылка
		|	И НЕ КассыККМ.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)"
		);
		Запрос.УстановитьПараметр("Магазин", Магазин);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
		
			Отказ = Истина;
			СтрокаСообщения = НСтр("ru = 'Касса с такими же параметрами уже существует
										 |«" + Выборка.Наименование + "» :
										 |Магазин      - " + Магазин + "
										 |Организация  - " + Владелец + "
										 |РабочееМесто - " + РабочееМесто + "'"); 
			Сообщить(СтрокаСообщения);
		
		КонецЕсли;

		Если НЕ (Отказ ИЛИ ПодключаемоеОборудование.Пустая()) Тогда

			СписокОборудования = Справочники.ПодключаемоеОборудование.ПолучитьСписокОборудования("ФискальныйРегистратор"
				,
				, РабочееМесто
				, 2
				, ?(ПРРО, 1, 2)
			);
			#Если _ Тогда
			СписокОборудования = Новый Соответствие;
			#КонецЕсли

			Если СписокОборудования.Получить(ПодключаемоеОборудование) = Неопределено Тогда

				Отказ = Истина;
				Сообщить("Отказано. Подключенное оборудование не соответствует флагу «ПРРО»!");

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
